arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/hal/inc/fsl_lpuart_hal.h
/*
 * Copyright (c) 2013 - 2014, Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
#ifndef __FSL_LPUART_HAL_H__
#define __FSL_LPUART_HAL_H__

#include "fsl_device_registers.h"
#include <stdbool.h>

/*!
 * @addtogroup lpuart_hal
 * @{
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/
#define LPUART_SHIFT (16U)
#define LPUART_BAUD_REG_ID (0U)
#define LPUART_STAT_REG_ID (1U)
#define LPUART_CTRL_REG_ID (2U)
#define LPUART_DATA_REG_ID (3U)
#define LPUART_MATCH_REG_ID (4U)
#define LPUART_MODIR_REG_ID (5U)
#define LPUART_FIFO_REG_ID (6U)
#define LPUART_WATER_REG_ID (7U)

/*! @brief Error codes for the LPUART driver.*/
typedef enum _lpuart_status
{
    LPUART_STAT_SUCCESS                     = 0x00U,
    LPUART_STAT_FAIL                        = 0x01U,
    LPUART_STAT_BAUD_RATE_CALCULATION_ERROR = 0x02U,
    LPUART_STAT_RX_STAND_BY_MODE_ERROR      = 0x03U,
    LPUART_STAT_CLEAR_STATUS_FLAG_ERROR     = 0x04U,
    LPUART_STAT_TX_NOT_DISABLED             = 0x05U,
    LPUART_STAT_RX_NOT_DISABLED             = 0x06U,
    LPUART_STAT_TX_BUSY                     = 0x07U,
    LPUART_STAT_RX_BUSY                     = 0x08U,
    LPUART_STAT_NO_TRANSMIT_IN_PROGRESS     = 0x09U,
    LPUART_STAT_NO_RECEIVE_IN_PROGRESS      = 0x0AU,
    LPUART_STAT_TIMEOUT                     = 0x0BU,
    LPUART_STAT_INITIALIZED                 = 0x0CU,
    LPUART_STAT_NO_DATA_TO_DEAL             = 0x0DU,
    LPUART_STAT_RX_OVERRUN                  = 0x0EU,
    LPUART_STAT_CLOCK_GATED_OFF             = 0x0FU
} lpuart_status_t;

/*! @brief LPUART number of stop bits*/
typedef enum _lpuart_stop_bit_count {
    LPUART_ONE_STOP_BIT = 0x0U, /*!< one stop bit @internal gui name="1" */
    LPUART_TWO_STOP_BIT = 0x1U, /*!< two stop bits @internal gui name="2" */
} lpuart_stop_bit_count_t;

/*! @brief LPUART parity mode*/
typedef enum _lpuart_parity_mode {
    LPUART_PARITY_DISABLED = 0x0U, /*!< parity disabled @internal gui name="Disabled" */
    LPUART_PARITY_EVEN     = 0x2U, /*!< parity enabled, type even, bit setting: PE|PT = 10 @internal gui name="Even" */
    LPUART_PARITY_ODD      = 0x3U, /*!< parity enabled, type odd,  bit setting: PE|PT = 11 @internal gui name="Odd" */
} lpuart_parity_mode_t;

/*! @brief LPUART number of bits in a character*/
typedef enum  _lpuart_bit_count_per_char {
    LPUART_8_BITS_PER_CHAR  = 0x0U, /*!< 8-bit data characters @internal gui name="8" */
    LPUART_9_BITS_PER_CHAR  = 0x1U, /*!< 9-bit data characters @internal gui name="9" */
    LPUART_10_BITS_PER_CHAR = 0x2U, /*!< 10-bit data characters @internal gui name="10" */
} lpuart_bit_count_per_char_t;

/*! @brief LPUART operation configuration constants*/
typedef enum _lpuart_operation_config {
    LPUART_OPERATES = 0x0U, /*!< LPUART continues to operate normally.*/
    LPUART_STOPS    = 0x1U, /*!< LPUART stops operation. */
} lpuart_operation_config_t;

/*! @brief LPUART wakeup from standby method constants*/
typedef enum _lpuart_wakeup_method {
    LPUART_IDLE_LINE_WAKE = 0x0U, /*!< Idle-line wakes the LPUART receiver from standby. */
    LPUART_ADDR_MARK_WAKE = 0x1U, /*!< Addr-mark wakes LPUART receiver from standby.*/
} lpuart_wakeup_method_t;

/*! @brief LPUART idle line detect selection types*/
typedef enum _lpuart_idle_line_select {
    LPUART_IDLE_LINE_AFTER_START_BIT = 0x0U, /*!< LPUART idle character bit count start after start bit */
    LPUART_IDLE_LINE_AFTER_STOP_BIT  = 0x1U, /*!< LPUART idle character bit count start after stop bit */
} lpuart_idle_line_select_t;

/*!
 * @brief LPUART break character length settings for transmit/detect.
 *
 * The actual maximum bit times may vary depending on the LPUART instance.
 */
typedef enum _lpuart_break_char_length {
    LPUART_BREAK_CHAR_10_BIT_MINIMUM = 0x0U, /*!< LPUART break char length 10 bit times (if M = 0, SBNS = 0)
                                      or 11 (if M = 1, SBNS = 0 or M = 0, SBNS = 1) or 12 (if M = 1,
                                      SBNS = 1 or M10 = 1, SNBS = 0) or 13 (if M10 = 1, SNBS = 1) */
    LPUART_BREAK_CHAR_13_BIT_MINIMUM = 0x1U, /*!< LPUART break char length 13 bit times (if M = 0, SBNS = 0
                                           or M10 = 0, SBNS = 1) or 14 (if M = 1, SBNS = 0 or M = 1,
                                           SBNS = 1) or 15 (if M10 = 1, SBNS = 1 or M10 = 1, SNBS = 0) */
} lpuart_break_char_length_t;

/*! @brief LPUART single-wire mode TX direction*/
typedef enum _lpuart_singlewire_txdir {
    LPUART_SINGLE_WIRE_TX_DIR_IN  = 0x0U, /*!< LPUART Single Wire mode TXDIR input*/
    LPUART_SINGLE_WIRE_TX_DIR_OUT = 0x1U, /*!< LPUART Single Wire mode TXDIR output*/
} lpuart_singlewire_txdir_t;

/*! @brief LPUART Configures the match addressing mode used.*/
typedef enum _lpuart_match_config {
    LPUART_ADDRESS_MATCH_WAKEUP     = 0x0U, /*!< Address Match Wakeup*/
    LPUART_IDLE_MATCH_WAKEUP        = 0x1U, /*!< Idle Match Wakeup*/
    LPUART_MATCH_ON_AND_MATCH_OFF   = 0x2U, /*!< Match On and Match Off*/
    LPUART_ENABLE_RWU_ON_DATA_MATCH = 0x3U, /*!< Enables RWU on Data Match and Match On/Off for transmitter CTS input*/
} lpuart_match_config_t;

/*! @brief LPUART infra-red transmitter pulse width options*/
typedef enum _lpuart_ir_tx_pulsewidth {
    LPUART_IR_THREE_SIXTEENTH_WIDTH   = 0x0U, /*!< 3/16 pulse*/
    LPUART_IR_ONE_SIXTEENTH_WIDTH     = 0x1U, /*!< 1/16 pulse*/
    LPUART_IR_ONE_THIRTYSECOND_WIDTH  = 0x2U, /*!< 1/32 pulse*/
    LPUART_IR_ONE_FOURTH_WIDTH        = 0x3U, /*!< 1/4 pulse*/
} lpuart_ir_tx_pulsewidth_t;

/*!
 * @brief LPUART Configures the number of idle characters that must be received
 * before the IDLE flag is set.
 */
typedef enum _lpuart_idle_char {
    LPUART_1_IDLE_CHAR   = 0x0U, /*!< 1 idle character*/
    LPUART_2_IDLE_CHAR   = 0x1U, /*!< 2 idle character*/
    LPUART_4_IDLE_CHAR   = 0x2U, /*!< 4 idle character*/
    LPUART_8_IDLE_CHAR   = 0x3U, /*!< 8 idle character*/
    LPUART_16_IDLE_CHAR  = 0x4U, /*!< 16 idle character*/
    LPUART_32_IDLE_CHAR  = 0x5U, /*!< 32 idle character*/
    LPUART_64_IDLE_CHAR  = 0x6U, /*!< 64 idle character*/
    LPUART_128_IDLE_CHAR = 0x7U, /*!< 128 idle character*/
} lpuart_idle_char_t;

/*! @brief LPUART Transmits the CTS Configuration. Configures the source of the CTS input.*/
typedef enum _lpuart_cts_source {
    LPUART_CTS_SOURCE_PIN                     = 0x0U,  /*!< CTS input is the LPUART_CTS pin.*/
    LPUART_CTS_SOURCE_INVERTED_RECEIVER_MATCH = 0x1U, /*!< CTS input is the inverted Receiver Match result.*/
} lpuart_cts_source_t;

/*!
 * @brief LPUART Transmits CTS Source.Configures if the CTS state is checked at
 * the start of each character or only when the transmitter is idle.
 */
typedef enum _lpuart_cts_config {
    LPUART_CTS_SAMPLED_ON_EACH_CHAR = 0x0U, /*!< CTS input is sampled at the start of each character.*/
    LPUART_CTS_SAMPLED_ON_IDLE      = 0x1U, /*!< CTS input is sampled when the transmitter is idle.*/
} lpuart_cts_config_t;

/*! @brief Structure for idle line configuration settings*/
typedef struct LpuartIdleLineConfig {
    unsigned idleLineType : 1; /*!< ILT, Idle bit count start: 0 - after start bit (default),
                                    1 - after stop bit */
    unsigned rxWakeIdleDetect : 1; /*!< RWUID, Receiver Wake Up Idle Detect. IDLE status bit
                                        operation during receive standbyControls whether idle
                                        character that wakes up receiver will also set
                                        IDLE status bit 0 - IDLE status bit doesn't
                                        get set (default), 1 - IDLE status bit gets set*/
} lpuart_idle_line_config_t;

/*!
 * @brief LPUART status flags.
 *
 * This provides constants for the LPUART status flags for use in the UART functions.
 */
typedef enum _lpuart_status_flag {
    LPUART_TX_DATA_REG_EMPTY          = LPUART_STAT_REG_ID << LPUART_SHIFT | LPUART_STAT_TDRE_SHIFT,    /*!< Tx data register empty flag, sets when Tx buffer is empty */
    LPUART_TX_COMPLETE                = LPUART_STAT_REG_ID << LPUART_SHIFT | LPUART_STAT_TC_SHIFT,      /*!< Transmission complete flag, sets when transmission activity complete */
    LPUART_RX_DATA_REG_FULL           = LPUART_STAT_REG_ID << LPUART_SHIFT | LPUART_STAT_RDRF_SHIFT,    /*!< Rx data register full flag, sets when the receive data buffer is full */
    LPUART_IDLE_LINE_DETECT           = LPUART_STAT_REG_ID << LPUART_SHIFT | LPUART_STAT_IDLE_SHIFT,    /*!< Idle line detect flag, sets when idle line detected */
    LPUART_RX_OVERRUN                 = LPUART_STAT_REG_ID << LPUART_SHIFT | LPUART_STAT_OR_SHIFT,      /*!< Rx Overrun, sets when new data is received before data is read from receive register */
    LPUART_NOISE_DETECT               = LPUART_STAT_REG_ID << LPUART_SHIFT | LPUART_STAT_NF_SHIFT,      /*!< Rx takes 3 samples of each received bit.  If any of these samples differ, noise flag sets */
    LPUART_FRAME_ERR                  = LPUART_STAT_REG_ID << LPUART_SHIFT | LPUART_STAT_FE_SHIFT,      /*!< Frame error flag, sets if logic 0 was detected where stop bit expected */
    LPUART_PARITY_ERR                 = LPUART_STAT_REG_ID << LPUART_SHIFT | LPUART_STAT_PF_SHIFT,      /*!< If parity enabled, sets upon parity error detection */
    LPUART_LIN_BREAK_DETECT           = LPUART_STAT_REG_ID << LPUART_SHIFT | LPUART_STAT_LBKDIF_SHIFT,  /*!< LIN break detect interrupt flag, sets when LIN break char detected and LIN circuit enabled */
    LPUART_RX_ACTIVE_EDGE_DETECT      = LPUART_STAT_REG_ID << LPUART_SHIFT | LPUART_STAT_RXEDGIF_SHIFT, /*!< Rx pin active edge interrupt flag, sets when active edge detected */
    LPUART_RX_ACTIVE                  = LPUART_STAT_REG_ID << LPUART_SHIFT | LPUART_STAT_RAF_SHIFT,     /*!< Receiver Active Flag (RAF), sets at beginning of valid start bit */
    LPUART_NOISE_IN_CURRENT_WORD      = LPUART_DATA_REG_ID << LPUART_SHIFT | LPUART_DATA_NOISY_SHIFT,   /*!< NOISY bit, sets if noise detected in current data word */
    LPUART_PARITY_ERR_IN_CURRENT_WORD = LPUART_DATA_REG_ID << LPUART_SHIFT | LPUART_DATA_PARITYE_SHIFT, /*!< PARITYE bit, sets if noise detected in current data word */
#if FSL_FEATURE_LPUART_HAS_ADDRESS_MATCHING
    LPUART_MATCH_ADDR_ONE             = LPUART_STAT_REG_ID << LPUART_SHIFT | LPUART_STAT_MA1F_SHIFT,    /*!< Address one match flag */
    LPUART_MATCH_ADDR_TWO             = LPUART_STAT_REG_ID << LPUART_SHIFT | LPUART_STAT_MA2F_SHIFT,    /*!< Address two match flag */
#endif
#if FSL_FEATURE_LPUART_FIFO_SIZE
    LPUART_FIFO_TX_OF                 = LPUART_FIFO_REG_ID << LPUART_SHIFT | LPUART_FIFO_TXOF_SHIFT,    /*!< Transmitter FIFO buffer overflow */
    LPUART_FIFO_RX_UF                 = LPUART_FIFO_REG_ID << LPUART_SHIFT | LPUART_FIFO_RXUF_SHIFT,    /*!< Receiver FIFO buffer underflow */
#endif
} lpuart_status_flag_t;

