arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/hal/inc/fsl_lpuart_hal.h
/*!
 * @brief  Places the LPUART receiver in a normal mode.
 *
 * This function places the LPUART receiver in a normal mode (disable standby mode operation).
 *
 *
 * @param base LPUART base pointer
 */
static inline void LPUART_HAL_PutReceiverInNormalMode(LPUART_Type * base)
{
    BITBAND_ACCESS32(&(base->CTRL), LPUART_CTRL_RWU_SHIFT) = (uint32_t)0;
}

/*!
 * @brief  Checks whether the LPUART receiver is in a standby mode.
 *
 * This function returns whether the LPUART receiver is in a standby mode.
 *
 *
 * @param base LPUART base pointer
 * @return LPUART in normal more (0) or standby (1)
 */
static inline bool LPUART_HAL_IsReceiverInStandby(LPUART_Type * base)
{
    return (bool)BITBAND_ACCESS32(&(base->CTRL), LPUART_CTRL_RWU_SHIFT);
}

/*!
 * @brief  Sets the LPUART receiver wakeup method from standby mode.
 *
 * This function sets the LPUART receiver wakeup method (idle line or addr-mark)
 * from standby mode.
 *
 *
 * @param base LPUART base pointer
 * @param method   LPUART wakeup method: 0 - Idle-line wake (default), 1 - addr-mark wake
 */
static inline void LPUART_HAL_SetReceiverWakeupMode(LPUART_Type * base,
                                                    lpuart_wakeup_method_t method)
{
    BITBAND_ACCESS32(&(base->CTRL), LPUART_CTRL_WAKE_SHIFT) = (uint32_t)method;
}

/*!
 * @brief  Gets the LPUART receiver wakeup method from standby mode.
 *
 * This function returns the LPUART receiver wakeup method (idle line or addr-mark)
 * from standby mode.
 *
 *
 * @param base LPUART base pointer
 * @return  LPUART wakeup method: kLpuartIdleLineWake: 0 - Idle-line wake (default),
 *          kLpuartAddrMarkWake: 1 - addr-mark wake
 */
static inline lpuart_wakeup_method_t LPUART_HAL_GetReceiverWakeupMode(LPUART_Type * base)
{
    return (lpuart_wakeup_method_t)BITBAND_ACCESS32(&(base->CTRL), LPUART_CTRL_WAKE_SHIFT);
}

/*!
 * @brief  LPUART idle-line detect operation configuration.
 *
 * This function configures idle-line detect operation configuration
 * (idle line bit-count start and wake up affect on IDLE status bit).
 * In some LPUART instances, the user should disable the transmitter/receiver
 * before calling this function.
 * Generally, this may be applied to all LPUARTs to ensure safe operation.
 *
 * @param base LPUART base pointer
 * @param config   LPUART configuration data for idle line detect operation
 */
void LPUART_HAL_SetIdleLineDetect(LPUART_Type * base,
                                  const lpuart_idle_line_config_t *config);

/*!
 * @brief  LPUART break character transmit length configuration
 *
 * This function configures the break char length.
 * In some LPUART instances, the user should disable the transmitter before calling
 * this function. Generally, this may be applied to all LPUARTs to ensure safe operation.
 *
 * @param base LPUART base pointer
 * @param length   LPUART break character length setting: 0 - minimum 10-bit times (default),
 *                   1 - minimum 13-bit times
 */
static inline void LPUART_HAL_SetBreakCharTransmitLength(LPUART_Type * base,
                                             lpuart_break_char_length_t length)
{
    BITBAND_ACCESS32(&(base->STAT), LPUART_STAT_BRK13_SHIFT) = (uint32_t)length;
}

/*!
 * @brief  LPUART break character detect length configuration
 *
 * This function sets the LPUART detectable break character length.
 *
 *
 * @param base LPUART base pointer
 * @param length  LPUART break character length setting: 0 - minimum 10-bit times (default),
 *                  1 - minimum 13-bit times
 */
static inline void LPUART_HAL_SetBreakCharDetectLength(LPUART_Type * base,
                                           lpuart_break_char_length_t length)
{
    BITBAND_ACCESS32(&(base->STAT), LPUART_STAT_LBKDE_SHIFT) = (uint32_t)length;
}

/*!
 * @brief  LPUART transmit sends break character configuration.
 *
 * This function sets break character transmission mode (normal/queue).
 *
 *
 * @param base LPUART base pointer
 * @param enable LPUART normal/queue break char - disabled (normal mode, default: 0) or
 *                 enabled (queue break char: 1)
 */
static inline void LPUART_HAL_QueueBreakCharToSend(LPUART_Type * base, bool enable)
{
    BITBAND_ACCESS32(&(base->CTRL), LPUART_CTRL_SBK_SHIFT) = (uint32_t)enable;
}

/*!
 * @brief Configures match address mode control.
 *
 * This function configures match address mode control.
 *
 *
 * @param base LPUART base pointer
 * @param config MATCFG: Configures the match addressing mode used.
 */
static inline void LPUART_HAL_SetMatchAddressMode(LPUART_Type * base, lpuart_match_config_t config)
{
    uint32_t baudRegValTemp;

    baudRegValTemp = base->BAUD;
    baudRegValTemp &= ~(LPUART_BAUD_MATCFG_MASK);
    baudRegValTemp |= LPUART_BAUD_MATCFG(config);
    base->BAUD = baudRegValTemp;
}

/*!
 * @brief Configures address match register 1.
 *
 * This function configures address match register 1.
 * The MAEN bit must be cleared before configuring MA value, so the enable/disable
 * and set value must be included inside one function.
 *
 * @param base LPUART base pointer
 * @param enable Match address model enable (true)/disable (false)
 * @param value Match address value to program into match address register 1
 */
void LPUART_HAL_SetMatchAddressReg1(LPUART_Type * base, bool enable, uint8_t value);

/*!
 * @brief Configures address match register 2.
 *
 * This function configures address match register 2.
 * The MAEN bit must be cleared before configuring MA value, so the enable/disable
 * and set value must be included inside one function.
 *
 * @param base LPUART base pointer
 * @param enable Match address model enable (true)/disable (false)
 * @param value Match address value to program into match address register 2
 */
void LPUART_HAL_SetMatchAddressReg2(LPUART_Type * base, bool enable, uint8_t value);

/*!
 * @brief LPUART sends the MSB first configuration
 *
 * This function configures whether MSB is sent first.
 * Note: In some LPUART instances, the user should disable the transmitter/receiver
 * before calling this function.
 * Generally, this may be applied to all LPUARTs to ensure safe operation.
 *
 * @param base LPUART base pointer
 * @param enable  false - LSB (default, disabled), true - MSB (enabled)
 */
static inline void LPUART_HAL_SetSendMsbFirstCmd(LPUART_Type * base, bool enable)
{
    BITBAND_ACCESS32(&(base->STAT), LPUART_STAT_MSBF_SHIFT) = (uint32_t)enable;
}

/*!
 * @brief  LPUART enable/disable re-sync of received data configuration.
 *
 * This function enables or disables re-sync of received data, based on the
 * parameter received.
 *
 *
 * @param base LPUART base pointer
 * @param enable  re-sync of received data word configuration:
 *                true - re-sync of received data word (default)
 *                false - disable the re-sync
 */
static inline void LPUART_HAL_SetReceiveResyncCmd(LPUART_Type * base, bool enable)
{
    /* When disabled, the resynchronization of the received data word when a data
     * one followed by data zero transition is detected. This bit should only be
     * changed when the receiver is disabled. */
    BITBAND_ACCESS32(&(base->BAUD), LPUART_BAUD_RESYNCDIS_SHIFT) = (uint32_t)enable;
}

