arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/hal/inc/fsl_lpuart_hal.h
#if FSL_FEATURE_LPUART_HAS_MODEM_SUPPORT
/*!
 * @brief  Transmits the CTS source configuration.
 *
 * This function transmits the CTS source configuration.
 *
 *
 * @param base LPUART base pointer
 * @param source   LPUART CTS source
 */
static inline void LPUART_HAL_SetCtsSource(LPUART_Type * base,
                                           lpuart_cts_source_t source)
{
    BITBAND_ACCESS32(&(base->MODIR), LPUART_MODIR_TXCTSSRC_SHIFT) = (uint32_t)source;
}

/*!
 * @brief  Transmits the CTS configuration.
 *
 * This function transmits the CTS configuration.
 * Note: configures if the CTS state is checked at the start of each character
 * or only when the transmitter is idle.
 *
 *
 * @param base LPUART base pointer
 * @param mode     LPUART CTS configuration
 */
static inline void LPUART_HAL_SetCtsMode(LPUART_Type * base, lpuart_cts_config_t mode)
{
    BITBAND_ACCESS32(&(base->MODIR), LPUART_MODIR_TXCTSC_SHIFT) = (uint32_t)mode;
}

/*!
 * @brief Enable/Disable the transmitter clear-to-send.
 *
 * This function controls the transmitter clear-to-send, based on the parameter
 * received.
 *
 *
 * @param base LPUART base pointer
 * @param enable  disable(0)/enable(1) transmitter CTS.
 */
static inline void LPUART_HAL_SetTxCtsCmd(LPUART_Type * base, bool enable)
{
    BITBAND_ACCESS32(&(base->MODIR), LPUART_MODIR_TXCTSE_SHIFT) = (uint32_t)enable;
}

/*!
 * @brief  Enable/Disable the receiver request-to-send.
 *
 * This function enables  or disables the receiver request-to-send, based 
 * on the parameter received.
 * Note: do not enable both Receiver RTS (RXRTSE) and Transmit RTS (TXRTSE).
 *
 *
 * @param base LPUART base pointer
 * @param enable  disable(0)/enable(1) receiver RTS.
 */
static inline void LPUART_HAL_SetRxRtsCmd(LPUART_Type * base, bool enable)
{
    BITBAND_ACCESS32(&(base->MODIR), LPUART_MODIR_RXRTSE_SHIFT) = (uint32_t)enable;
}

/*!
 * @brief  Enable/Disable the transmitter request-to-send.
 *
 * This function enables  or disables the transmitter request-to-send, based 
 * on the parameter received.
 * Note: do not enable both Receiver RTS (RXRTSE) and Transmit RTS (TXRTSE).
 *
 *
 * @param base LPUART base pointer
 * @param enable  disable(0)/enable(1) transmitter RTS.
 */
static inline void LPUART_HAL_SetTxRtsCmd(LPUART_Type * base, bool enable)
{
    BITBAND_ACCESS32(&(base->MODIR), LPUART_MODIR_TXRTSE_SHIFT) = (uint32_t)enable;
}

/*!
 * @brief Configures the transmitter RTS polarity.
 *
 * This function configures the transmitter RTS polarity.
 *
 *
 * @param base LPUART base pointer
 * @param polarity Settings to choose RTS polarity (0=active low, 1=active high)
 */
static inline void LPUART_HAL_SetTxRtsPolarityMode(LPUART_Type * base, bool polarity)
{
    BITBAND_ACCESS32(&(base->MODIR), LPUART_MODIR_TXRTSPOL_SHIFT) = (uint32_t)polarity;
}

#endif  /* FSL_FEATURE_LPUART_HAS_MODEM_SUPPORT */

#if FSL_FEATURE_LPUART_FIFO_SIZE
/*!
 * @brief  Enable/Disable the transmitter FIFO.
 *
 * This function enables or disables the transmitter FIFO structure, based 
 * on the parameter received.
 * Note: The size of the FIFO structure is indicated by TXFIFOSIZE.
 *
 *
 * @param base LPUART base pointer
 * @param enable  disable(0)/enable(1) transmitter FIFO.
 */
static inline void LPUART_HAL_SetTxFIFOCmd(LPUART_Type * base, bool enable)
{
    BITBAND_ACCESS32(&(base->FIFO), LPUART_FIFO_TXFE_SHIFT) = (uint32_t)enable;
}

/*!
 * @brief  Enable/Disable the receiver FIFO.
 *
 * This function enables or disables the receiver FIFO structure, based 
 * on the parameter received.
 * Note: The size of the FIFO structure is indicated by RXFIFOSIZE.
 *
 *
 * @param base LPUART base pointer
 * @param enable  disable(0)/enable(1) receiver FIFO.
 */
static inline void LPUART_HAL_SetRxFIFOCmd(LPUART_Type * base, bool enable)
{
    BITBAND_ACCESS32(&(base->FIFO), LPUART_FIFO_RXFE_SHIFT) = (uint32_t)enable;
}

/*!
 * @brief Enables the assertion of RDRF when the receiver is idle.
 *
 * This function enables the assertion of RDRF when the receiver is idle for 
 * a number of idle characters and the FIFO is not empty.
 *
 *
 * @param base LPUART base pointer.
 * @param duration  The number of characters the receiver must be empty before RDRF assertion
 *        0 - disabled, >0 - rx must be idle for 2^(duration-1) characters before RDRF assertion
 */
static inline void LPUART_HAL_SetRxIdleEmptyDuration(LPUART_Type * base, uint8_t duration)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(duration < ((uint8_t)(1U << LPUART_FIFO_RXIDEN_WIDTH)));
#endif
    uint32_t fifoRegValTemp;

    fifoRegValTemp = base->FIFO;
    fifoRegValTemp &= ~(LPUART_FIFO_RXIDEN_MASK);
    fifoRegValTemp |= LPUART_FIFO_RXIDEN(duration);
    base->FIFO = fifoRegValTemp;
}

/*!
 * @brief  Flush tx FIFO buffer.
 *
 * This function flushes the tx FIFO buffer.
 * Note: This does not affect data that is in the transmit shift register.
 *
 *
 * @param base LPUART base pointer
 */
static inline void LPUART_HAL_FlushTxFifoBuffer(LPUART_Type * base)
{
    BITBAND_ACCESS32(&(base->FIFO), LPUART_FIFO_TXFLUSH_SHIFT) = (uint32_t)1U;
}

/*!
 * @brief  Flush rx FIFO buffer.
 *
 * This function flushes the rx FIFO buffer.
 * Note: This does not affect data that is in the receive shift register.
 *
 *
 * @param base LPUART base pointer
 */
static inline void LPUART_HAL_FlushRxFifoBuffer(LPUART_Type * base)
{
    BITBAND_ACCESS32(&(base->FIFO), LPUART_FIFO_RXFLUSH_SHIFT) = (uint32_t)1U;
}

/*!
 * @brief  Sets the tx watermark.
 *
 * This function sets the tx FIFO watermark.
 * When the number of datawords in the transmit FIFO/buffer is equal to or less than the value in 
 * this register field, an interrupt or a DMA request is generated.
 * Note: For proper operation, the value in TXWATER must be set to be less than the 
 * transmit FIFO/buffer size and greater than 0.
 *
 *
 * @param base LPUART base pointer
 * @param txWater Tx FIFO Watermark
 */
static inline void LPUART_HAL_SetTxWatermark(LPUART_Type * base, uint8_t txWater)
{
#ifdef DEV_ERROR_DETECT
    uint8_t txFifoSize = ((uint8_t)((base->FIFO >> LPUART_FIFO_TXFIFOSIZE_SHIFT) & LPUART_FIFO_TXFIFOSIZE_MASK));
    DEV_ASSERT(txFifoSize > 0U);
    DEV_ASSERT(txWater < ((uint8_t)(1U << (txFifoSize + 1U)));
#endif
    uint32_t waterRegValTemp;

    waterRegValTemp = base->WATER;
    waterRegValTemp &= ~(LPUART_WATER_TXWATER_MASK);
    waterRegValTemp |= LPUART_WATER_TXWATER(txWater);
    base->WATER = waterRegValTemp;
}

/*!
 * @brief  Sets the rx watermark.
 *
 * This function sets the rx FIFO watermark.
 * When the number of datawords in the receive FIFO/buffer is greater than the value in 
 * this register field, an interrupt or a DMA request is generated.
 * Note: For proper operation, the value in RXWATER must be set to be less than the 
 * receive FIFO/buffer size and greater than 0.
 *
 *
 * @param base LPUART base pointer
 * @param rxWater Rx FIFO Watermark
 */
static inline void LPUART_HAL_SetRxWatermark(LPUART_Type * base, uint8_t rxWater)
{
#ifdef DEV_ERROR_DETECT
    uint8_t rxFifoSize = ((uint8_t)((base->FIFO >> LPUART_FIFO_RXFIFOSIZE_SHIFT) & LPUART_FIFO_RXFIFOSIZE_MASK));
    DEV_ASSERT(rxFifoSize > 0U);
    DEV_ASSERT(rxWater < ((uint8_t)(1U << (rxFifoSize + 1U)));
#endif
    uint32_t waterRegValTemp;

    waterRegValTemp = base->WATER;
    waterRegValTemp &= ~(LPUART_WATER_RXWATER_MASK);
    waterRegValTemp |= LPUART_WATER_RXWATER(rxWater);
    base->WATER = waterRegValTemp;
}

#endif /* FSL_FEATURE_LPUART_FIFO_SIZE */

#if FSL_FEATURE_LPUART_HAS_IR_SUPPORT
/*!
 * @brief  Configures the LPUART infrared operation.
 *
 * This function configures the LPUART infrared operation.
 *
 *
 * @param base LPUART base pointer
 * @param enable    Enable (1) or disable (0) the infrared operation
 * @param pulseWidth The transmit narrow pulse width of type lpuart_ir_tx_pulsewidth_t
 */
void LPUART_HAL_SetInfrared(LPUART_Type * base, bool enable,
                            lpuart_ir_tx_pulsewidth_t pulseWidth);
#endif  /* FSL_FEATURE_LPUART_HAS_IR_SUPPORT */

/*@}*/

#if defined(__cplusplus)
}
#endif

/*! @}*/

#endif /* __FSL_LPUART_HAL_H__ */
/*******************************************************************************
 * EOF
 ******************************************************************************/

